## Production: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 4 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                      |
|----------|-----------------------------------------------|
| update   | `aws_alb_listener_rule.idp_protocol_version`  |
|          | `aws_lb_listener.idp`                         |
|          | `aws_wafv2_web_acl.idp`                       |
|          | `module.idp_ecs.aws_ecs_service.this`         |
| recreate | `aws_lb_target_group.idp[&quot;HTTP1&quot;]`            |
|          | `aws_lb_target_group.idp[&quot;HTTP2&quot;]`            |
|          | `random_string.idp_alb_tg_suffix`             |
|          | `module.idp_ecs.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_alb_listener_rule.idp_protocol_version will be updated in-place
  ~ resource "aws_alb_listener_rule" "idp_protocol_version" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener-rule/app/idp/2874d2f76ab9b3d3/a9d3ba5be4729b8f/54fd0f23356cad8f"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.idp will be updated in-place
  ~ resource "aws_lb_listener" "idp" {
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener/app/idp/2874d2f76ab9b3d3/a9d3ba5be4729b8f"
        tags                                                                  = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (26 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.idp["HTTP1"] must be replaced
+/- resource "aws_lb_target_group" "idp" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:957818836222:loadbalancer/app/idp/2874d2f76ab9b3d3",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "idp-tg-HTTP1-baq" -> (known after apply) # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTPS" -> "HTTP" # forces replacement
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ protocol            = "HTTPS" -> "HTTP"
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.idp["HTTP2"] must be replaced
+/- resource "aws_lb_target_group" "idp" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ca-central-1:957818836222:loadbalancer/app/idp/2874d2f76ab9b3d3",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "idp-tg-HTTP2-baq" -> (known after apply) # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTPS" -> "HTTP" # forces replacement
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ protocol            = "HTTPS" -> "HTTP"
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.idp will be updated in-place
  ~ resource "aws_wafv2_web_acl" "idp" {
        id                          = "399b414e-14cc-4120-93f6-829fbdc5c275"
        name                        = "idp"
        tags                        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "BlockedIPv4" -> null
          - priority = 70 -> null

          - action {
              - count {
                }
            }

          - statement {
              - ip_set_reference_statement {
                  - arn = "arn:aws:wafv2:ca-central-1:957818836222:regional/ipset/ipv4_blocklist_forms_app/bb31e744-97dd-45e2-995b-78659ac5ec18" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "BlockedIPv4" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "BlockedIPv4"
          + priority = 70

          + action {
              + block {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = "arn:aws:wafv2:ca-central-1:957818836222:regional/ipset/ipv4_blocklist_forms_app/bb31e744-97dd-45e2-995b-78659ac5ec18"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockedIPv4"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (7 unchanged blocks hidden)
    }

  # random_string.idp_alb_tg_suffix must be replaced
+/- resource "random_string" "idp_alb_tg_suffix" {
      ~ id          = "baq" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "protocol"          = "HTTPS" -> "HTTP"
            # (2 unchanged elements hidden)
        }
      ~ result      = "baq" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.idp_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "zitadel"
      + task_role_arn        = (known after apply)
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:957818836222:service/idp/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:29" -> (known after apply)
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "zitadel" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> null
            # (1 unchanged attribute hidden)
        }
      - load_balancer {
          - container_name   = "zitadel" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "zitadel"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "zitadel"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - Command                = [
                      - "start-from-init",
                      - "--masterkeyFromEnv",
                      - "--tlsMode",
                      - "enabled",
                      - "--config",
                      - "/app/config.yaml",
                      - "--steps",
                      - "/app/steps.yaml",
                    ]
                  - Cpu                    = 0
                  - CredentialSpecs        = null
                  - DependsOn              = null
                  - DisableNetworking      = null
                  - DnsSearchDomains       = null
                  - DnsServers             = null
                  - DockerLabels           = null
                  - DockerSecurityOptions  = null
                  - EntryPoint             = null
                  - Environment            = [
                      - {
                          - Name  = "ZITADEL_EXTERNALDOMAIN"
                          - Value = "auth.forms-formulaires.alpha.canada.ca"
                        },
                    ]
                  - EnvironmentFiles       = null
                  - Essential              = true
                  - ExtraHosts             = null
                  - FirelensConfiguration  = null
                  - HealthCheck            = null
                  - Hostname               = null
                  - Image                  = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                  - Interactive            = null
                  - Links                  = null
                  - LinuxParameters        = {
                      - Capabilities       = {
                          - Add  = []
                          - Drop = [
                              - "ALL",
                            ]
                        }
                      - Devices            = null
                      - InitProcessEnabled = null
                      - MaxSwap            = null
                      - SharedMemorySize   = null
                      - Swappiness         = null
                      - Tmpfs              = null
                    }
                  - LogConfiguration       = {
                      - LogDriver     = "awslogs"
                      - Options       = {
                          - awslogs-group         = "/aws/ecs/idp/zitadel"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                      - SecretOptions = null
                    }
                  - Memory                 = null
                  - MemoryReservation      = null
                  - MountPoints            = []
                  - Name                   = "zitadel"
                  - PortMappings           = [
                      - {
                          - AppProtocol        = ""
                          - ContainerPort      = 8080
                          - ContainerPortRange = null
                          - HostPort           = 8080
                          - Name               = null
                          - Protocol           = "tcp"
                        },
                    ]
                  - Privileged             = null
                  - PseudoTerminal         = null
                  - ReadonlyRootFilesystem = true
                  - RepositoryCredentials  = null
                  - ResourceRequirements   = null
                  - Secrets                = [
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_PASSWORD"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password"
                        },
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_USERNAME"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username"
                        },
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_DATABASE"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_name"
                        },
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_HOST"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host"
                        },
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_password"
                        },
                      - {
                          - Name      = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_username"
                        },
                      - {
                          - Name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password"
                        },
                      - {
                          - Name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_USERNAME"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_username"
                        },
                      - {
                          - Name      = "ZITADEL_MASTERKEY"
                          - ValueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_secret_key"
                        },
                    ]
                  - StartTimeout           = null
                  - StopTimeout            = null
                  - SystemControls         = []
                  - Ulimits                = null
                  - User                   = null
                  - VolumesFrom            = []
                  - WorkingDirectory       = null
                  + command                = [
                      + "start-from-init",
                      + "--masterkeyFromEnv",
                      + "--tlsMode",
                      + "external",
                      + "--config",
                      + "/app/config.yaml",
                      + "--steps",
                      + "/app/steps.yaml",
                    ]
                  + environment            = [
                      + {
                          + name  = "ZITADEL_EXTERNALDOMAIN"
                          + value = "auth.forms-formulaires.alpha.canada.ca"
                        },
                    ]
                  + essential              = true
                  + image                  = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                  + linuxParameters        = {
                      + capabilities = {
                          + add  = []
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/idp/zitadel"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "zitadel"
                  + portMappings           = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = true
                  + secrets                = [
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_DATABASE"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_name"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_HOST"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_password"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_user_username"
                        },
                      + {
                          + name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password"
                        },
                      + {
                          + name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_username"
                        },
                      + {
                          + name      = "ZITADEL_MASTERKEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_secret_key"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "zitadel" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

Changes to Outputs:
  ~ lb_idp_target_groups_arn_suffix   = {
      ~ HTTP1 = "targetgroup/idp-tg-HTTP1-baq/3d3dbaa5a009d6a1" -> (known after apply)
      ~ HTTP2 = "targetgroup/idp-tg-HTTP2-baq/ac6ec94935e5f6a3" -> (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
